Repository: andrelug/webstory_importer
Catalog: languages/web-story-importer-*.po
Languages: pt_br

source: Web Story Importer
pt_br: Importador de Web Stories

source: Story Importer
pt_br: Importador de Stories

source: Please install and activate the Web Stories plugin before activating this plugin.
pt_br: Por favor, instale e ative o plugin Web Stories antes de ativar este plugin.

source: Uploading...
pt_br: Enviando...

source: Processing Web Story...
pt_br: Processando Web Story...

source: Importing...
pt_br: Importando...

source: Import successful!
pt_br: Importação bem-sucedida!

source: Error importing story.
pt_br: Erro ao importar story.

source: No file selected
pt_br: Nenhum arquivo selecionado

source: Import New Story
pt_br: Importar Nova Story

source: Imported Stories
pt_br: Stories Importadas

source: API Documentation
pt_br: Documentação da API

source: Import a Web Story from ZIP
pt_br: Importar uma Web Story a partir de um ZIP

source: Upload a .zip file containing your Web Story (HTML file and assets folder).
pt_br: Envie um arquivo .zip contendo sua Web Story (arquivo HTML e pasta de recursos).

source: Web Story ZIP File
pt_br: Arquivo ZIP da Web Story

source: Choose File
pt_br: Escolher Arquivo

source: Must be a .zip archive containing one .html file and an assets folder.
pt_br: Deve ser um arquivo .zip contendo um arquivo .html e uma pasta de recursos.

source: Import Story
pt_br: Importar Story

source: How to prepare your ZIP file
pt_br: Como preparar seu arquivo ZIP

source: Create a ZIP file containing your Web Story HTML file at the root level.
pt_br: Crie um arquivo ZIP contendo seu arquivo HTML da Web Story no nível raiz.

source: Include an "assets" folder containing all images, videos, and other media used in the story.
pt_br: Inclua uma pasta "assets" contendo todas as imagens, vídeos e outros recursos de mídia usados na story.

source: Make sure the HTML file references the assets using relative paths (e.g., "assets/image.jpg").
pt_br: Certifique-se de que o arquivo HTML faça referência aos recursos usando caminhos relativos (ex: "assets/image.jpg").

source: The ZIP file to import
pt_br: O arquivo ZIP para importar

source: Post status for the imported story (draft or publish)
pt_br: Status do post para a story importada (rascunho ou publicado)

source: You do not have permission to import web stories.
pt_br: Você não tem permissão para importar web stories.

source: The uploaded file exceeds the upload_max_filesize directive in php.ini.
pt_br: O arquivo enviado excede a diretiva upload_max_filesize no php.ini.

source: The uploaded file exceeds the MAX_FILE_SIZE directive in the HTML form.
pt_br: O arquivo enviado excede a diretiva MAX_FILE_SIZE no formulário HTML.

source: The uploaded file was only partially uploaded.
pt_br: O arquivo foi apenas parcialmente enviado.

source: No file was uploaded.
pt_br: Nenhum arquivo foi enviado.

source: Missing a temporary folder.
pt_br: Pasta temporária não encontrada.

source: Failed to write file to disk.
pt_br: Falha ao escrever o arquivo no disco.

source: A PHP extension stopped the file upload.
pt_br: Uma extensão PHP interrompeu o upload do arquivo.

source: Unknown upload error.
pt_br: Erro de upload desconhecido.

source: No file was uploaded or could not be processed. Please send a ZIP file with parameter name "file".
pt_br: Nenhum arquivo foi enviado ou não pôde ser processado. Por favor, envie um arquivo ZIP com o nome do parâmetro "file".

source: Could not initialize WordPress Filesystem.
pt_br: Não foi possível inicializar o Sistema de Arquivos do WordPress.

source: Upload directory is not writable.
pt_br: O diretório de upload não é gravável.

source: Could not create temporary directory: %s
pt_br: Não foi possível criar o diretório temporário: %s

source: Could not unzip the file.
pt_br: Não foi possível descompactar o arquivo.

source: Could not read the contents of the extracted folder.
pt_br: Não foi possível ler o conteúdo da pasta extraída.

source: No HTML file found in the root of the ZIP archive (or within a single nested folder).
pt_br: Nenhum arquivo HTML encontrado na raiz do arquivo ZIP (ou dentro de uma única pasta aninhada).

source: Multiple HTML files found in the root of the ZIP archive (or within a single nested folder). Please ensure only one is present.
pt_br: Vários arquivos HTML encontrados na raiz do arquivo ZIP (ou dentro de uma única pasta aninhada). Por favor, certifique-se de que apenas um esteja presente.
